RentaAutos/RentaAutos/app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "address", "city", "state", "zip", "certified_by", "experience", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "name" = ?, "address" = ?, "city" = ?, "zip" = ?, "certified_by" = ?, "experience" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["name", "Juan"], ["address", "test"], ["city", "test"], ["zip", 3], ["certified_by", "Maestra"], ["experience", 1], ["updated_at", "2017-05-01 22:33:33.544068"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @doctor.update(doctor_params)

DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 3]]
---
  def destroy
    @doctor.destroy

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_doctor
      @doctor = Doctor.find(params[:id])