RentaAutos/RentaAutos/app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "usuario"], ["password_digest", "$2a$10$1S7KFUUbV7Zl00wtA8/noeoF96N1N60BRsSplIuOY2TEoX934DioW"], ["created_at", "2017-03-25 02:40:13.176606"], ["updated_at", "2017-03-25 02:40:13.176606"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save